[
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/gastritis/symptoms-causes/syc-20355807",
    "title": "Gastritis",
    "content": "The stomach is a muscular sac. It's about the size of a small melon that expands when you eat or drink. It can hold as much as a gallon (about 4 liters) of food or liquid. Once the stomach grinds the food, strong muscle contractions called peristaltic waves push the food toward the pyloric valve. The pyloric valve leads to the upper part of the small intestine, called the duodenum. The stomach is a muscular sac. It's about the size of a small melon that expands when you eat or drink. It can hold as much as a gallon (about 4 liters) of food or liquid. Once the stomach grinds the food, strong muscle contractions called peristaltic waves push the food toward the pyloric valve. The pyloric valve leads to the upper part of the small intestine, called the duodenum. Gastritis is a general term for a group of conditions with one thing in common: Inflammation of the lining of the stomach. The inflammation of gastritis is most often the result of infection with the same bacterium that causes most stomach ulcers or the regular use of certain pain relievers. Drinking too much alcohol also can contribute to gastritis. Gastritis may occur suddenly (acute gastritis) or appear slowly over time (chronic gastritis). In some cases, gastritis can lead to ulcers and an increased risk of stomach cancer. For most people, however, gastritis isn't serious and improves quickly with treatment. Gastritis doesn't always cause symptoms. When it does, the symptoms of gastritis may include: Nearly everyone has had indigestion and stomach irritation at some point. Usually, indigestion doesn't last long and doesn't require medical care. See your healthcare professional if you have symptoms of gastritis for a week or longer. Seek medical attention right away if you have severe pain or if you have vomiting where you cannot hold any food down. Also seek attention right away if you feel lightheaded or dizzy. Tell your healthcare professional if your stomach discomfort happens after taking medicines, especially aspirin or other pain relievers. If you are vomiting blood, have blood in your stools or have stools that appear black, see your healthcare professional right away to find the cause. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes Gastritis is an inflammation of the stomach lining. The stomach lining is a mucus-lined barrier that protects the stomach wall. Weaknesses or injury to the barrier allows digestive juices to damage and inflame the stomach lining. Several diseases and conditions can increase the risk of gastritis. These include inflammatory conditions, such as Crohn's disease. Factors that increase your risk of gastritis include: Your own body attacking cells in your stomach.Called autoimmune gastritis, this type of gastritis occurs when your body attacks the cells that make up your stomach lining. This reaction can wear away at your stomach's protective barrier. Autoimmune gastritis is more common in people with other autoimmune disorders. These include Hashimoto's disease and type 1 diabetes. Autoimmune gastritis also can be associated with vitamin B-12 deficiency. Left untreated, gastritis may lead to stomach ulcers and stomach bleeding. Rarely, some forms of chronic gastritis may increase your risk of stomach cancer. This risk is increased if you have extensive thinning of the stomach lining and changes in the lining's cells. Tell your healthcare professional if your symptoms aren't improving despite treatment for gastritis.  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/celiac-disease/symptoms-causes/syc-20352220",
    "title": "Celiac disease",
    "content": "Your small intestine is lined with tiny hairlike projections called villi, which absorb sugars, fats, proteins, vitamins, minerals and other nutrients from the food you eat. Gluten exposure in people with celiac disease damages the villi, making it hard for the body to absorb nutrients necessary for health and growth. Your small intestine is lined with tiny hairlike projections called villi, which absorb sugars, fats, proteins, vitamins, minerals and other nutrients from the food you eat. Gluten exposure in people with celiac disease damages the villi, making it hard for the body to absorb nutrients necessary for health and growth. Celiac disease is an autoimmune condition where the immune system reacts to gluten, sometimes causing damage to the small intestine. Gluten is a protein found in foods containing wheat, barley or rye. If you have celiac disease, eating gluten triggers an immune response to the gluten protein in your small intestine. Over time, this reaction can damage your small intestine's lining and prevent it from absorbing nutrients. This condition is called malabsorption. The intestinal damage often causes symptoms such as diarrhea, fatigue, weight loss, bloating or anemia. It also can lead to serious complications if it is not managed or treated. In children, malabsorption can affect growth and development in addition to gastrointestinal symptoms. There's no definite cure for celiac disease. But for most people, following a strict gluten-free diet can help manage symptoms and help the intestines heal. The symptoms of celiac disease can vary greatly. They also may be different in children and adults. Digestive symptoms for adults include: However, more than half the adults with celiac disease have symptoms that are not related to the digestive system, including: Children with celiac disease are more likely than adults to have digestive problems, including: Not being able to absorb nutrients may cause: Gluten intolerance can cause this blistery skin disease. The rash usually happens on the elbows, knees, torso, scalp or buttocks. Like celiac disease, this condition is often associated with changes to the lining of the small intestine. However, dermatitis herpetiformis might not cause digestive symptoms. Healthcare professionals treat dermatitis herpetiformis with a gluten-free diet or medicine, or both, to control the rash. Consult your healthcare team if you have diarrhea or digestive discomfort that lasts for more than two weeks. Consult your child's healthcare team if your child: Be sure to consult your healthcare team before trying a gluten-free diet. If you stop or even reduce the amount of gluten you eat before you're tested for celiac disease, you can change the test results. Celiac disease tends to run in families. If someone in your family has the condition, ask a member of your healthcare team if you should be tested. Also ask about testing if you or someone in your family has a risk factor for celiac disease, such as type 1 diabetes. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes A person's genes, combined with eating foods with gluten and other factors, can contribute to celiac disease. However, the precise cause isn't known. Infant-feeding practices, gastrointestinal infections and gut bacteria may contribute, but these causes have not been proved. Sometimes celiac disease becomes active after surgery, pregnancy, childbirth, viral infection or severe emotional stress. When the body's immune system overreacts to gluten in food, the reaction damages the tiny, hairlike projections, called villi, that line the small intestine. Villi absorb vitamins, minerals and other nutrients from the food you eat. If your villi are damaged, you can't get enough nutrients, no matter how much you eat. Celiac disease tends to be more common in people who have: Celiac disease that is not treated can lead to: Some people with celiac disease don't respond to what they consider to be a gluten-free diet. Nonresponsive celiac disease is often due to contamination of the diet with gluten. Working with a dietitian can help you learn how to avoid all gluten. People with nonresponsive celiac disease might have: In rare instances, the intestinal injury of celiac disease doesn't respond to a strict gluten-free diet. This is known as refractory celiac disease. If you still have symptoms after following a gluten-free diet for 6 months to 1 year, you should talk to your healthcare team to see if you need further testing to look for explanations for your symptoms.  Celiac disease care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/diverticulitis/symptoms-causes/syc-20371758",
    "title": "Diverticulitis",
    "content": "Diverticulosis occurs when small, bulging pouches (diverticula) develop in your digestive tract. When one or more of these pouches become inflamed or infected, the condition is called diverticulitis. Diverticulosis occurs when small, bulging pouches (diverticula) develop in your digestive tract. When one or more of these pouches become inflamed or infected, the condition is called diverticulitis. Diverticulitis is inflammation of irregular bulging pouches in the wall of the large intestine. Typically, the wall of the large intestine, also called the colon, is smooth. An irregular, bulging pouch in the colon wall is called a diverticulum. Multiple pouches are called diverticula. Diverticula are common, especially after age 50. They are usually found in the lower part of the colon. Most often, they don't cause problems. The presence of diverticula is called diverticulosis. Diverticulosis isn't a disease condition. When these pouches become inflamed, the condition is called diverticulitis. Inflammation is immune system activity that increases blood flow and fluids to a site in the body and delivers disease-fighting cells. Inflammation of diverticula can cause severe pain, fever, nausea and changes in your stool habits. Mild diverticulitis is usually treated with rest, changes in your diet and possibly antibiotics. Severe diverticulitis usually needs antibiotic treatment in the hospital. Surgery may be needed for severe or frequent diverticulitis. A common symptom of diverticulitis is pain in the area below the chest called the abdomen. Most often, pain is in the lower left abdomen. Pain from diverticulitis is usually sudden and intense. Pain may be mild and gradually worsen, or the intensity of the pain may vary over time. Other signs and symptoms of diverticulitis may include: Get medical care anytime you have constant, unexplained abdominal pain, particularly if you also have a fever and notable changes in stools. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes Diverticula gradually develop over time in the walls of the colon. They are common in older adults. Pressure in the colon — possibly from spasms or straining — may cause diverticula to form where the wall of the colon is weak. Diverticulitis is inflammation of one or more diverticula. This may happen because of bacterial disease or damage to diverticula tissues. Diverticulitis is more common among people over 50. Other factors that increase the risk of diverticulitis include: About 15 percent of people with diverticulitis develop complications. These may include: To help prevent diverticulitis: In the past, healthcare professionals recommended that people with diverticulitis avoid nuts, seeds and popcorn. Studies have shown that these foods do not increase the risk of diverticulitis. Seeds and some nuts are good sources of fiber.  Diverticulitis care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/irritable-bowel-syndrome/symptoms-causes/syc-20360016",
    "title": "Irritable bowel syndrome",
    "content": "Irritable bowel syndrome (IBS) is a common condition that affects the stomach and intestines, also called the gastrointestinal tract. Symptoms include cramping, belly pain, bloating, gas, and diarrhea or constipation, or both.IBSis an ongoing condition that needs long-term management. Only a small number of people withIBShave severe symptoms. Some people can control their symptoms by managing diet, lifestyle and stress. More-severe symptoms can be treated with medicine and counseling. IBSdoesn't cause changes in bowel tissue or increase risk of colorectal cancer. Symptoms ofIBSvary but are usually present for a long time. The most common include: Other symptoms that are often related include sensation of incomplete evacuation and increased gas or mucus in the stool. IBS is a functional disorder. Even though the digestive tract looks normal, it doesn't function as it should. Muscles in the intestines move food from the stomach to the rectum. Normally, they contract and relax in a gentle rhythm that moves the food along in a fairly predictable schedule. But with some people, the muscles in the intestines spasm. That means the contractions are longer and stronger than normal. Those spasms are painful. They also disrupt the movement of food through the intestines. If they slow it down, you become constipated. If they cause it to move through too quickly, you get diarrhea. It's not unusual for people to alternate between the two. Another cause of discomfort for people with IBS results from oversensitive nerve endings in the digestive tract. Small bubbles of gas that wouldn't bother most people might be quite painful for you. Your heightened sensitivity can also lead to swelling and bloating. See a healthcare professional if you have a persistent change in bowel habits or other symptoms ofIBS. They may mean a more serious condition, such as colon cancer. More-serious symptoms include: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes The exact cause ofIBSisn't known. Factors that appear to play a role include: Symptoms ofIBScan be triggered by: Many people have occasional symptoms ofIBS. But you're more likely to have the syndrome if you: Long-lasting constipation or diarrhea can cause hemorrhoids. In addition,IBSis associated with:  Irritable bowel syndrome care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/pancreatitis/symptoms-causes/syc-20360227",
    "title": "Pancreatitis",
    "content": "Gallstones are a common cause of pancreatitis. Gallstones, produced in the gallbladder, can slip out of the gallbladder and block the bile duct, stopping pancreatic enzymes from traveling to the small intestine and forcing them back into the pancreas. The enzymes then begin to irritate the cells of the pancreas, causing the inflammation associated with pancreatitis. Gallstones are a common cause of pancreatitis. Gallstones, produced in the gallbladder, can slip out of the gallbladder and block the bile duct, stopping pancreatic enzymes from traveling to the small intestine and forcing them back into the pancreas. The enzymes then begin to irritate the cells of the pancreas, causing the inflammation associated with pancreatitis. Pancreatitis is inflammation of the pancreas. Inflammation is immune system activity that can cause swelling, pain, and changes in how an organ or tissues work. The pancreas is a long, flat gland that's tucked behind the stomach. The pancreas helps the body digest food and regulates blood sugars. Pancreatitis can be an acute condition. This means it appears suddenly and generally lasts a short time. Chronic pancreatitis is a long-term condition. The damage to the pancreas can get worse over time. Acute pancreatitis may improve on its own. More-serious disease requires treatment in a hospital and can cause life-threatening complications. Symptoms of pancreatitis may vary. Acute pancreatitis symptoms may include: Chronic pancreatitis signs and symptoms include: Some people with chronic pancreatitis only develop symptoms after they get complications of the disease. Make an appointment with your doctor if you have sudden belly pain or belly pain that doesn't improve. Seek immediate medical help if your pain is so severe that you can't sit still or find a position that makes you more comfortable. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes The pancreas has two major roles. It produces insulin, which helps the body manage and use sugars. The pancreas also produces dietary juices, called enzymes, that help with digestion. The pancreas makes and stores \"turned off\" versions of the enzymes. After the pancreas sends the enzymes into the small intestine, they are \"turned on\" and break down proteins in the small intestine. If the enzymes are turned on too soon, they can start acting like digestive juices inside the pancreas. The action can irritate, damage or destroy cells. This problem, in turn, leads to immune system responses that cause swelling and other events that affect how the pancreas works. Several conditions can lead to acute pancreatitis, including: Conditions that can lead to chronic pancreatitis include: Sometimes, a cause for pancreatitis is never found. This is known as idiopathic pancreatitis. Factors that increase your risk of pancreatitis include: Pancreatitis can cause serious complications, including:  Pancreatitis care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/gallstones/symptoms-causes/syc-20354214",
    "title": "Gallstones",
    "content": "Gallstones are hardened deposits of digestive fluid that can form in your gallbladder. Your gallbladder is a small, pear-shaped organ on the right side of your abdomen, just beneath your liver. The gallbladder holds a digestive fluid called bile that's released into your small intestine. Gallstones are hardened deposits of bile that can form in your gallbladder. Bile is a digestive fluid produced in your liver and stored in your gallbladder. When you eat, your gallbladder contracts and empties bile into your small intestine (duodenum). Gallstones range in size from as small as a grain of sand to as large as a golf ball. Some people develop just one gallstone, while others develop many gallstones at the same time. People who experience symptoms from their gallstones usually require gallbladder removal surgery. Gallstones that don't cause any signs and symptoms typically don't need treatment. Gallstones may cause no signs or symptoms. If a gallstone lodges in a duct and causes a blockage, the resulting signs and symptoms may include: Gallstone pain may last several minutes to a few hours. Make an appointment with your doctor if you have any signs or symptoms that worry you. Seek immediate care if you develop signs and symptoms of a serious gallstone complication, such as: We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. It's not clear what causes gallstones to form. Doctors think gallstones may result when: Types of gallstones that can form in the gallbladder include: Factors that may increase your risk of gallstones include: Complications of gallstones may include: Blockage of the pancreatic duct.The pancreatic duct is a tube that runs from the pancreas and connects to the common bile duct just before entering the duodenum. Pancreatic juices, which aid in digestion, flow through the pancreatic duct. A gallstone can cause a blockage in the pancreatic duct, which can lead to inflammation of the pancreas (pancreatitis). Pancreatitis causes intense, constant abdominal pain and usually requires hospitalization. You can reduce your risk of gallstones if you: Apr 16, 2025 CON-20198823 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/cholecystitis/symptoms-causes/syc-20364867",
    "title": "Cholecystitis",
    "content": "The gallbladder serves as a reservoir for a yellow-green fluid produced in the liver, called bile. Bile flows from the liver into the gallbladder, where it's held until needed during the digestion of food. When you eat, the gallbladder releases bile into the bile duct. It's then carried to the upper part of the small intestine, called the duodenum, to help break down fat in food. The gallbladder serves as a reservoir for a yellow-green fluid produced in the liver, called bile. Bile flows from the liver into the gallbladder, where it's held until needed during the digestion of food. When you eat, the gallbladder releases bile into the bile duct. It's then carried to the upper part of the small intestine, called the duodenum, to help break down fat in food. Cholecystitis (ko-luh-sis-TIE-tis) is swelling and irritation, called inflammation, of the gallbladder. The gallbladder is a small, pear-shaped organ on the right side of the belly under the liver. The gallbladder holds fluid that digests food. This fluid is called bile. The gallbladder releases bile into the small intestine. Most often, gallstones that block the tube leading out of the gallbladder cause cholecystitis. This results in a bile buildup that can cause inflammation. Other causes of cholecystitis include bile duct changes, tumors, serious illness and certain infections. If not treated, cholecystitis can lead to serious complications, such as gallbladder rupture. These can be life-threatening. Treatment for cholecystitis often involves surgery to remove the gallbladder. Symptoms of cholecystitis may include: Cholecystitis symptoms often come on after a meal. A large or fatty meal is most likely to cause symptoms. Make an appointment with your healthcare professional if you have symptoms that worry you. If your belly pain is so bad that you can't sit still or get comfortable, have someone drive you to the emergency room. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes Gallstones are hard pieces of bile that can form in the gallbladder. Bile is a fluid that digests food. The liver makes it. It's stored in the gallbladder. During eating, the gallbladder contracts and empties bile into the part of the small intestine called the duodenum. Gallstones are hard pieces of bile that can form in the gallbladder. Bile is a fluid that digests food. The liver makes it. It's stored in the gallbladder. During eating, the gallbladder contracts and empties bile into the part of the small intestine called the duodenum. Cholecystitis is when your gallbladder is inflamed. Gallbladder inflammation can be caused by: Having gallstones is the main risk factor for getting cholecystitis. If not treated, cholecystitis can lead to serious complications, including: You can reduce your risk of cholecystitis by taking the following steps to prevent gallstones:  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/intestinal-obstruction/symptoms-causes/syc-20351460",
    "title": "Intestinal obstruction",
    "content": "Intestinal obstruction is a blockage that keeps food or liquid from passing through your small intestine or large intestine (colon). Causes of intestinal obstruction may include fibrous bands of tissue (adhesions) in the abdomen that form after surgery; hernias; colon cancer; certain medications; or strictures from an inflamed intestine caused by certain conditions, such as Crohn's disease or diverticulitis. The small intestine and colon are parts of your digestive tract, which processes the foods you eat. The intestines take nutrients from the foods. What isn't absorbed by the intestines continues along the digestive tract and is passed as stool during a bowel movement. Without treatment, the blocked parts of the intestine can die, leading to serious problems. However, with prompt medical care, intestinal obstruction often can be successfully treated. Signs and symptoms of intestinal obstruction include: Because of the serious complications that can develop from intestinal obstruction, seek immediate medical care if you have severe abdominal pain or other symptoms of intestinal obstruction. We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. The most common causes of intestinal obstruction in adults are: In children, the most common cause of intestinal obstruction is telescoping of the intestine (intussusception). Intussusception is a rare, serious disorder in which one part of the intestine slides inside an adjacent part. Other possible causes of intestinal obstruction include: Intestinal pseudo-obstruction (paralytic ileus) can cause signs and symptoms of intestinal obstruction, but it doesn't involve a physical blockage. In paralytic ileus, muscle or nerve problems disrupt the normal coordinated muscle contractions of the intestines, slowing or stopping the movement of food and fluid through the digestive system. Paralytic ileus can affect any part of the intestine. Causes can include: Diseases and conditions that can increase your risk of intestinal obstruction include: Untreated, intestinal obstruction can cause serious, life-threatening complications, including: Jan 20, 2021 CON-20157215 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/lactose-intolerance/symptoms-causes/syc-20374232",
    "title": "Lactose intolerance",
    "content": "People with lactose intolerance are unable to fully digest the sugar (lactose) in milk. As a result, they have diarrhea, gas and bloating after eating or drinking dairy products. The condition, which is also called lactose malabsorption, is usually harmless, but its symptoms can be uncomfortable. Too little of an enzyme produced in your small intestine (lactase) is usually responsible for lactose intolerance. You can have low levels of lactase and still be able to digest milk products. But if your levels are too low you become lactose intolerant, leading to symptoms after you eat or drink dairy. The small intestine and colon are parts of your digestive tract, which processes the foods you eat. The intestines take nutrients from the foods. What isn't absorbed by the intestines continues along the digestive tract and is passed as stool during a bowel movement. Most people with lactose intolerance can manage the condition without having to give up all dairy foods. The signs and symptoms of lactose intolerance usually begin from 30 minutes to two hours after eating or drinking foods that contain lactose. Common signs and symptoms include: Make an appointment with your doctor if you frequently have symptoms of lactose intolerance after eating dairy foods, particularly if you're worried about getting enough calcium. We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. Lactose intolerance occurs when your small intestine doesn't produce enough of an enzyme (lactase) to digest milk sugar (lactose). Normally, lactase turns milk sugar into two simple sugars — glucose and galactose — which are absorbed into the bloodstream through the intestinal lining. If you're lactase deficient, lactose in your food moves into the colon instead of being processed and absorbed. In the colon, normal bacteria interact with undigested lactose, causing the signs and symptoms of lactose intolerance. There are three types of lactose intolerance. Different factors cause the lactase deficiency underlying each type. People who develop primary lactose intolerance — the most common type — start life producing enough lactase. Infants, who get all their nutrition from milk, need lactase. As children replace milk with other foods, the amount of lactase they produce normally drops, but usually remains high enough to digest the amount of dairy in a typical adult diet. In primary lactose intolerance, lactase production falls off sharply by adulthood, making milk products difficult to digest. This form of lactose intolerance occurs when your small intestine decreases lactase production after an illness, injury or surgery involving your small intestine. Diseases associated with secondary lactose intolerance include intestinal infection, celiac disease, bacterial overgrowth and Crohn's disease. Treatment of the underlying disorder might restore lactase levels and improve signs and symptoms, though it can take time. It's possible, but rare, for babies to be born with lactose intolerance caused by a lack of lactase. This disorder is passed from generation to generation in a pattern of inheritance called autosomal recessive, meaning that both the mother and the father must pass on the same gene variant for a child to be affected. Premature infants can also have lactose intolerance because of an insufficient lactase level. Factors that can make you or your child more prone to lactose intolerance include: Mar 05, 2022 CON-20374217 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/functional-dyspepsia/symptoms-causes/syc-20375709",
    "title": "Functional dyspepsia",
    "content": "Functional dyspepsia is a term used to describe a lingering upset stomach that has no obvious cause. Functional dyspepsia (dis-PEP-see-uh) also is called nonulcer dyspepsia. Functional dyspepsia is common. It is a constant condition, but symptoms don't happen all the time. Symptoms are like those of an ulcer. They include pain or discomfort in the upper belly, bloating, belching and nausea. Symptoms of functional dyspepsia may include: Make an appointment with a healthcare professional if you experience constant symptoms that worry you. Seek medical attention right away if you experience: No one knows what causes functional dyspepsia. Medical professionals consider it a functional disorder. That means it can't be explained by a medical condition, so routine testing may not show any problems or causes. As a result, the diagnosis is based on symptoms. Some factors can increase the risk of functional dyspepsia. They include:  Functional dyspepsia care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/ulcerative-colitis/symptoms-causes/syc-20353326",
    "title": "Ulcerative colitis",
    "content": "Listen to gastroenterologist William Faubion, M.D., walk through ulcerative colitis basics. [Music playing] William A. Faubion, Jr., M.D., Gastroenterology, Mayo ClinicI'm Dr. Bill Faubion, a gastroenterologist at Mayo Clinic. In this video, we'll cover the basics of ulcerative colitis. What is it? Who gets it? The symptoms, diagnosis, and treatment. Whether you're looking for answers for yourself or someone you love, we're here to give you the best information available. Ulcerative colitis is an inflammatory bowel disease that causes chronic inflammation and ulcers in the superficial lining of the large intestine, also called the colon. And that includes the rectum. It's estimated that about a million Americans are living with ulcerative colitis, making it the most common form of inflammatory bowel disease. It can be painful and debilitating, occasionally leading to severe complications. It can also be emotionally stressful. And while there is no cure, once you've been diagnosed, treatment can help you get back to a much more normal and comfortable life. Who gets it? The exact cause of ulcerative colitis is unknown, but there are things that appear to trigger or aggravate it. It may involve an abnormal immune response against some microorganism in which your tissues are also attacked. Genetics might also play a role. You are at higher risk if a first-degree relative has it. There's also a correlation with age. Although it can show up at any stage of life, most people are diagnosed before the age of 30. And ethnicity is a risk factor. Whites have the highest risk, especially among people of Ashkenazi Jewish descent. While diet and stress don't cause ulcerative colitis, they are known to exacerbate symptoms. What are the symptoms? Most people have mild to moderate cases of ulcerative colitis. Although it can be more severe, you may also experience periods of remission when you have no issues at all. A person's symptoms depend on the severity of the case in the area of the colon that's involved. They usually develop over time, and they can include diarrhea, often with blood or pus, fever, fatigue, anemia, loss of appetite and weight loss, abdominal pain and cramping, rectal pain and bleeding, the need for a bowel movement, yet the inability to do so despite the urgency. And in children, delayed growth and development. Over time, ulcerative colitis can lead to other complications, such as severe dehydration, a perforated colon, bone loss, inflammation of your skin, joints and eyes. It can also increase your risk for blood clots and colon cancer. These symptoms don't automatically mean that you have ulcerative colitis. But if you're experiencing anything that concerns you, it's a good idea to make an appointment with your doctor. How is it diagnosed? The only way to definitively diagnose ulcerative colitis is with a biopsy after taking a tissue sample through an endoscopic procedure. But first, less invasive things can be done to rule out other causes. First, your doctor will consider your medical history. They may want to run a variety of tests or procedures. And at some point, your general practitioner may refer you to a specialist called a gastroenterologist like myself. A blood test can check for anemia and check for signs of infection. A stool study can test for white blood cells and other specific proteins that point to ulcerative colitis, as well as rule out certain pathogens. A colonoscopy may be needed. This allows your doctor to view the entirety of the large intestine using an endoscope, a small camera mounted on a thin flexible tube. They can take tissue samples for a biopsy at the same time. Or if your colon is extremely inflamed, they may do a flexible sigmoidoscopy, which only goes as far as the rectum and lower or sigmoid colon. If your symptoms are more severe, your doctor may want some imaging done. An abdominal x-ray can rule out serious complications, like a perforated colon. An MRI or CT scan can also be performed for a more detailed view of the bowel, as well as to reveal the extent of the inflammation. How is it treated? Although there is no cure for ulcerative colitis there are widely effective treatments, usually involving either drug therapy or surgery. Your doctor can work with you to find things that alleviate your symptoms and in some cases, even bring about long-term remission. Treatments may include anti-inflammatory drugs like corticosteroids and immune system suppressants. Certain targeted therapies directed against the immune system called biologics can help. Antidiarrheals, pain relievers, antispasmodics and iron supplements can help counter other symptoms. And surgery may be required to remove the damaged tissue. In extreme cases, the whole colon may be removed. Which sounds drastic, but this can sometimes be the best option for eliminating the pain and struggle of ulcerative colitis once and for all. Some of these therapies may have side effects themselves. So be sure to review the risks and benefits with your doctor. What now? Ulcerative colitis can be physically and emotionally challenging, but there are things that can help. Although there's no firm evidence that any foods cause ulcerative colitis, certain things seem to aggravate flare-ups. So a food diary can help you identify personal triggers. Beyond that, limit dairy products, eat small meals, stay hydrated, try to avoid caffeine and alcohol and carbonation. If you're concerned about weight loss or if your diet has become too limited, talk to a registered dietitian. It's important to take care of your mental health, too. Find ways to manage stress, like exercise, breathing and relaxation techniques or biofeedback. Some symptoms like abdominal pain, gas, and diarrhea can cause anxiety and frustration. That can make it difficult to be out in public for any amount of time. It can feel limiting and isolating and lead to depression. So learn as much as you can about ulcerative colitis. Staying informed can help a lot in feeling like you're in control of your condition. Talk to a therapist, especially one familiar with inflammatory bowel disease. Your doctor should be able to give you some recommendations. And you might want to find a support group for people going through the same thing that you are. Ulcerative colitis is a complex disease, but having expert medical care and developing a treatment strategy can make it more manageable and even help patients get back to the freedom of a normal life. Meanwhile, significant advances continue to be made in understanding and treating the disease and getting us closer to curing it or preventing it entirely. If you'd like to learn even more about ulcerative colitis, watch our other related videos or visit mayoclinic.org. We wish you well. [Music playing] The colon, also called the large intestine, is a long tubelike organ in the abdomen. The colon carries waste to be expelled from the body. The rectum makes up the last several inches of the large intestine. The colon, also called the large intestine, is a long tubelike organ in the abdomen. The colon carries waste to be expelled from the body. The rectum makes up the last several inches of the large intestine. Ulcerative colitis is a type of inflammatory bowel disease (IBD) that causes inflammation and sores, called ulcers, in part of the digestive tract. Ulcerative colitis (UL-sur-uh-tiv koe-LIE-tis) affects the innermost lining of the large intestine, called the colon, and rectum. Symptoms usually develop over time, rather than coming on suddenly. Ulcerative colitis can weaken the body and can sometimes lead to life-threatening complications. While it has no known cure, treatment can greatly reduce and relieve symptoms of the disease. It also may bring about long-term remission. Ulcerative colitis symptoms can vary, depending on how serious the inflammation is and where it happens. Symptoms may include: About half of the people with ulcerative colitis have mild to moderate symptoms. The course of ulcerative colitis may vary, with some people having long periods of remission. Healthcare professionals often classify ulcerative colitis according to its location. Types of ulcerative colitis include: See a healthcare professional if you notice a lasting change in your bowel habits or if you have symptoms such as: Although ulcerative colitis usually isn't fatal, it's a serious disease that, in some cases, may cause life-threatening complications. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes The exact cause of ulcerative colitis isn't known. Previously, diet and stress were suspected, but now healthcare professionals know that these factors may worsen but don't cause ulcerative colitis. Possible causes may include: Ulcerative colitis affects about the same number of women and men. Risk factors may include: Possible complications of ulcerative colitis include:  Ulcerative colitis care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/colon-cancer/symptoms-causes/syc-20353669",
    "title": "Colon cancer",
    "content": "Colon cancer can happen in any part of the colon. An exam of the whole colon using a long, flexible tube with a camera is one way to detect colon cancer and polyps. This exam is called a colonoscopy. Colon cancer can happen in any part of the colon. An exam of the whole colon using a long, flexible tube with a camera is one way to detect colon cancer and polyps. This exam is called a colonoscopy. Colon cancer is a growth of cells that begins in a part of the large intestine called the colon. The colon is the first and longest part of the large intestine. The large intestine is the last part of the digestive system. The digestive system breaks down food for the body to use. Colon cancer typically affects older adults, though it can happen at any age. It usually begins as small clumps of cells called polyps that form inside the colon. Polyps generally aren't cancerous, but some can turn into colon cancers over time. Polyps often don't cause symptoms. For this reason, doctors recommend regular screening tests to look for polyps in the colon. Finding and removing polyps helps prevent colon cancer. If colon cancer develops, many treatments can help control it. Treatments include surgery, radiation therapy and medicines, such as chemotherapy, targeted therapy and immunotherapy. Colon cancer is sometimes called colorectal cancer. This term combines colon cancer and rectal cancer, which begins in the rectum. Many people with colon cancer don't have symptoms at first. When symptoms appear, they'll likely depend on the cancer's size and where it is in the large intestine. Symptoms of colon cancer can include: If you notice lasting symptoms that worry you, make an appointment with a health care professional. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and receive the latest on colon cancer treatment, care and management. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You will receive the first colon cancer care journey message in your inbox shortly, which will include the latest treatment options, innovations and other information from our colon cancer experts. Please, try again in a couple of minutes Doctors aren't certain what causes most colon cancers. Colon cancer happens when cells in the colon develop changes in their DNA. A cells' DNA holds the instructions that tell the cell what to do. The changes tell the cells to multiply quickly. The changes let the cells continue living when healthy cells die as part of their natural lifecycle. This causes too many cells. The cells might form a mass called a tumor. The cells can invade and destroy healthy body tissue. In time, the cells can break away and spread to other parts of the body. When cancer spreads, it's called metastatic cancer. Factors that may increase the risk of colon cancer include: Doctors recommend that people with an average risk of colon cancer consider starting colon cancer screening around age 45. But people with an increased risk should think about starting screening sooner. People with an increased risk include those with a family history of colon cancer. There are several different tests that are used for colon cancer screening. Talk about your options with your health care team. Making changes in everyday life can reduce the risk of colon cancer. To lower the risk of colon cancer: Some medicines can reduce the risk of colon polyps or colon cancer. For instance, some evidence links a reduced risk of polyps and colon cancer to regular use of aspirin or aspirin-like medicines. But it's not clear what dose and what length of time would be needed to reduce the risk of colon cancer. Taking aspirin daily has some risks, including ulcers and bleeding in the digestive system. These options are generally reserved for people with a high risk of colon cancer. There isn't enough evidence to recommend these medicines to people who have an average risk of colon cancer. If you have an increased risk of colon cancer, discuss your risk factors with your health care team to see if preventive medicines are safe for you.  Colon cancer care at Mayo Clinic Connect with others like you for support and answers to your questions in theColorectal Cancer support groupon Mayo Clinic Connect, a patient community. 29 RepliesFri, Aug 08, 2025 92 RepliesFri, Jul 18, 2025 270 RepliesMon, Jul 14, 2025 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/constipation/symptoms-causes/syc-20354253",
    "title": "Constipation",
    "content": "Constipation is a problem with passing stool. Constipation generally means passing fewer than three stools a week or having a difficult time passing stool. Constipation is fairly common. A lack of dietary fiber, fluids and exercise can cause constipation. But other medical conditions or certain medicines may be the cause. Constipation is usually treated with changes in diet and exercise or with nonprescription medicines. Constipation may require medicines, changes in medicines or other treatments prescribed by a health care professional. Long-term constipation, also called chronic constipation, may require treating another disease or condition that can cause or worsen constipation. Symptoms of constipation include: Chronic constipation is having two or more of these symptoms for three months or longer. Make an appointment with your health care professional if you have constipation with any of the following conditions: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes Patterns of bowel movements vary from one person to another. The typical range is three times a day to three times a week. So it's important to know what is typical for you. In general, constipation occurs when stool moves too slowly through the large intestine, also called the colon. If the stool moves slowly, the body absorbs too much water from the stool. The stool can become hard, dry and difficult to pass. Slow stool movement may happen when a person does not: Constipation may be a side effect of some medicines, particularly opioid pain relievers. Other medicines that may cause constipation include some that treat the following conditions: The muscles that hold up organs at the bottom of the torso are called the pelvic floor muscles. The ability both to relax these muscles and to bear down are necessary to pass stool from the rectum. Problems with weakness or coordination of these muscles can cause chronic constipation. Damage or changes to tissues in the colon or rectum can block the passage of stool. Also, tumors in the colon, rectum or nearby tissues can cause a blockage. A number of conditions can affect the work of muscles, nerves or hormones involved in passing stool. Chronic constipation may be linked to any number of things, including: Sometimes, the cause of chronic constipation can't be found. Factors that may increase your risk of chronic constipation include: Complications of chronic constipation include: The following tips can help you avoid developing constipation.  Constipation care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/food-poisoning/symptoms-causes/syc-20356230",
    "title": "Food poisoning",
    "content": "Food poisoning, a type of foodborne illness, is a sickness people get from something they ate or drank. The causes are germs or other harmful things in the food or beverage. Symptoms of food poisoning often include upset stomach, diarrhea and vomiting. Symptoms usually start within hours or several days of eating the food. Most people have mild illness and get better without treatment. Sometimes food poisoning causes severe illness or complications. Symptoms vary depending on what is causing the illness. They may begin within a few hours or a few weeks depending on the cause. Common symptoms are: Less often food poisoning affects the nervous system and can cause severe disease. Symptoms may include: Vomiting and diarrhea can quickly cause low levels of body fluids, also called dehydration, in infants and children. This can cause serious illness in infants. Call your child's health care provider if your child's symptoms include vomiting and diarrhea and any of the following: Adults should see a health care provider or get emergency care if the following occur: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes Many germs or harmful things, called contaminants, can cause foodborne illnesses. Food or drink that carries a contaminant is called \"contaminated.\" Food can be contaminated with any of the following: The term \"food poisoning\" is commonly used to describe all foodborne illnesses. A health care provider might use these terms to be more specific: Food can be contaminated at any point from the farm or fishery to the table. The problem can begin during growing, harvesting or catching, processing, storing, shipping, or preparing. Food can be contaminated any place it's handled, including the home, because of: The following table shows common causes of foodborne illnesses, the time from exposure to the beginning of symptoms and common sources of contamination. Bacteria that cause foodborne illnesses can also be found in swimming pools, lakes, ponds, rivers and seawater. Also, some bacteria, such as E. coli, may be spread by exposure to animals carrying the disease. Anyone can get food poisoning. Some people are more likely to get sick or have more-serious disease or complications. These people include: In most healthy adults, complications are uncommon. They can include the following. The most common complication is dehydration. This a severe loss of water and salts and minerals. Both vomiting and diarrhea can cause dehydration. Most healthy adults can drink enough fluids to prevent dehydration. Children, older adults, and people with weakened immune systems or other illnesses may not be able to replace the fluids they've lost. They are more likely to become dehydrated. People who become dehydrated may need to get fluids directly into the bloodstream at the hospital. Severe dehydration can cause organ damage, other severe disease and death if not treated. Some contaminants can cause more widespread disease in the body, also called systemic disease or infection. This is more common in people who are older, have weakened immune systems or other medical conditions. Systemic infections from foodborne bacteria may cause: Illness from the listeria bacteria during pregnancy can result in: Rare complications include conditions that may develop after food poisoning, including: To prevent food poisoning at home: Food poisoning is especially serious during pregnancies and for young children, older adults and people with weakened immune systems. These illnesses may be life-threatening. These individuals should avoid the following foods:  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/gas-and-gas-pains/symptoms-causes/syc-20372709",
    "title": "Gas and gas pains",
    "content": "Gas in your digestive system is part of the normal process of digestion. Getting rid of excess gas, either by burping or passing gas (flatus), also is normal. Gas pain may occur if gas is trapped or not moving well through your digestive system. An increase in gas or gas pain may result from eating foods that are more likely to produce gas. Often, relatively simple changes in eating habits can lessen bothersome gas. Certain digestive system disorders, such as irritable bowel syndrome or celiac disease, may cause — in addition to other signs and symptoms — an increase in gas or gas pain. Signs or symptoms of gas or gas pains include: Burping is normal, particularly during or right after a meal. Most people pass gas up to 20 times a day. Therefore, while having gas may be inconvenient or embarrassing, burping and passing gas are rarely by themselves a sign of a medical problem. Talk to your doctor if your gas or gas pains are so persistent or severe that they interfere with your ability to function well in daily life. Gas or gas pains accompanied by other signs or symptoms may indicate more-serious conditions. See your doctor if you experience any of these additional signs or symptoms: Seek immediate care if you experience: We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. Gas in your stomach is primarily caused by swallowing air when you eat or drink. Most stomach gas is released when you burp. Gas forms in your large intestine (colon) when bacteria ferment carbohydrates — fiber, some starches and some sugars — that aren't digested in your small intestine. Bacteria also consume some of that gas, but the remaining gas is released when you pass gas from your anus. Certain high-fiber foods may cause gas, including: While high-fiber foods increase gas production, fiber is essential for keeping your digestive tract in good working order and regulating blood sugar and cholesterol levels. Other dietary factors that can contribute to increased gas in the digestive system include the following: Medical conditions that may increase intestinal gas, bloating or gas pain include the following: Jan 06, 2022 CON-20372695 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/symptoms-causes/syc-20378847",
    "title": "Viral gastroenteritis (stomach flu)",
    "content": "Viral gastroenteritis is an intestinal infection that includes signs and symptoms such as watery diarrhea, stomach cramps, nausea or vomiting, and sometimes fever. The most common way to develop viral gastroenteritis — often called stomach flu — is through contact with an infected person or by consuming contaminated food or water. If you're otherwise healthy, you'll likely recover without complications. But for infants, older adults and people with compromised immune systems, viral gastroenteritis can be deadly. There's no effective treatment for viral gastroenteritis, so prevention is key. Avoid food and water that may be contaminated and wash your hands thoroughly and often. Although it's commonly called stomach flu, gastroenteritis isn't the same as influenza. The flu (influenza) affects only your respiratory system — your nose, throat and lungs. Gastroenteritis, on the other hand, attacks your intestines, causing signs and symptoms such as: Depending on the cause, viral gastroenteritis symptoms may appear within 1-3 days after you're infected and can range from mild to severe. Symptoms usually last just a day or two, but occasionally they may last up to 14 days. Because the symptoms are similar, it's easy to confuse viral diarrhea with diarrhea caused by bacteria, such as Clostridioides difficile, salmonella and Escherichia coli, or parasites, such as giardia. The stomach, small intestine and large intestine (colon) are part of your digestive tract, which processes the foods you eat. Viral gastroenteritis is an inflammation of these organs caused by a virus. If you're an adult, call your health care provider if: See your child's health care provider right away if your child: If you have an infant, remember that while spitting up may be an everyday occurrence for your baby, vomiting is not. Babies vomit for a variety of reasons, many of which may require medical attention. Call your baby's doctor right away if your baby: We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You're most likely to get viral gastroenteritis when you eat or drink contaminated food or water. You may also be likely to get gastroenteritis if you share utensils, towels or food with someone who has one of the viruses that cause the condition. Many viruses can cause gastroenteritis, including: Noroviruses.Both children and adults are affected by noroviruses, the most common cause of foodborne illness worldwide. Norovirus infection can sweep through families and communities. It's especially likely to spread among people in confined spaces. In most cases, you pick up the virus from contaminated food or water. But it can also spread between people who are in close contact or who share food. You can also get the virus by touching a surface that's been contaminated with norovirus and then touching your mouth. Rotavirus.Worldwide, this is the most common cause of viral gastroenteritis in children, who are usually infected when they put their fingers or other objects contaminated with the virus into their mouths. It can also spread through contaminated food. The infection is most severe in infants and young children. Adults infected with rotavirus may not have symptoms, but can still spread the illness. This is of particular concern in institutional settings such as nursing homes because adults with the virus unknowingly can pass the virus to others. A vaccine against viral gastroenteritis is available in some countries, including the United States, and appears to be effective in preventing the infection. Some shellfish, especially raw or undercooked oysters, also can make you sick. Contaminated drinking water is a cause of viral diarrhea. But in many cases the virus is passed when someone with a virus handles food you eat without washing his or her hands after using the toilet. Gastroenteritis occurs all over the world and can affect people of all ages. People who may be more susceptible to gastroenteritis include: Each gastrointestinal virus has a season when it's most active. If you live in the Northern Hemisphere, for instance, you're more likely to have rotavirus or norovirus infections in the winter and spring. The main complication of viral gastroenteritis is dehydration — a severe loss of water and essential salts and minerals. If you're healthy and drink enough to replace fluids you lose from vomiting and diarrhea, dehydration shouldn't be a problem. Infants, older adults and people with weakened immune systems may become severely dehydrated when they lose more fluids than they can replace. Hospitalization might be needed so that lost fluids can be replaced through an IV in their arms. Dehydration can rarely lead to death. The best way to prevent the spread of intestinal infections is to follow these precautions: Wash your hands thoroughly.And make sure your children do, too. If your children are older, teach them to wash their hands, especially after using the toilet. Wash your hands after changing diapers and before preparing or eating food, too. It's best to use warm water and soap and to rub hands well for at least 20 seconds. Wash around cuticles, beneath fingernails and in the creases of the hands. Then rinse thoroughly. Carry sanitizing wipes and hand sanitizer for times when soap and water aren't available. When you're traveling in other countries, you can become sick from contaminated food or water. You may be able to reduce your risk by following these tips: Apr 30, 2025 CON-20378829 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/kidney-stones/symptoms-causes/syc-20355755",
    "title": "Kidney stones",
    "content": "Your urinary system includes the kidneys, ureters, bladder and urethra. The urinary system removes waste from the body through urine. The kidneys are located toward the back of the upper abdomen. They filter waste and fluid from the blood and produce urine. Urine moves from the kidneys through narrow tubes to the bladder. These tubes are called the ureters. The bladder stores urine until it's time to urinate. Urine leaves the body through another small tube called the urethra. Your urinary system includes the kidneys, ureters, bladder and urethra. The urinary system removes waste from the body through urine. The kidneys are located toward the back of the upper abdomen. They filter waste and fluid from the blood and produce urine. Urine moves from the kidneys through narrow tubes to the bladder. These tubes are called the ureters. The bladder stores urine until it's time to urinate. Urine leaves the body through another small tube called the urethra. Your urinary system includes the kidneys, ureters, bladder and urethra. The urinary system removes waste from the body through urine. The kidneys are located toward the back of the upper abdomen. They filter waste and fluid from the blood and produce urine. Urine moves from the kidneys through narrow tubes to the bladder. These tubes are called the ureters. The bladder stores urine until it's time to urinate. Urine leaves the body through another small tube called the urethra. Your urinary system includes the kidneys, ureters, bladder and urethra. The urinary system removes waste from the body through urine. The kidneys are located toward the back of the upper abdomen. They filter waste and fluid from the blood and produce urine. Urine moves from the kidneys through narrow tubes to the bladder. These tubes are called the ureters. The bladder stores urine until it's time to urinate. Urine leaves the body through another small tube called the urethra. Kidney stones are hard objects made of minerals and salts in urine. They form inside the kidneys. You may hear healthcare professionals refer to kidney stones as renal calculi, nephrolithiasis or urolithiasis. Kidney stones have various causes. These include diet, extra body weight, some health conditions, and some supplements and medicines. Kidney stones can affect any of the organs that make urine or remove it from the body — from the kidneys to the bladder. Often, stones form when the urine has less water in it. This lets minerals form crystals and stick together. Passing kidney stones can be quite painful. But prompt treatment usually helps prevent any lasting damage. Sometimes, the only treatment needed to pass a kidney stone is taking pain medicine and drinking lots of water. Other times, surgery or other treatments may be needed. It depends on size, location and the type of stone you have. If you've had more than one kidney stone, your healthcare professional can show you ways to prevent more. This may involve making diet changes, taking medicine or both. Kidney stones form in the kidneys. Symptoms may start as stones move into the ureters. The ureters are thin tubes that let urine pass from the kidneys to the bladder. Symptoms of kidney stones can include serious pain, upset stomach, vomiting, fever, chills and blood in the urine. Kidney stones form in the kidneys. Symptoms may start as stones move into the ureters. The ureters are thin tubes that let urine pass from the kidneys to the bladder. Symptoms of kidney stones can include serious pain, upset stomach, vomiting, fever, chills and blood in the urine. A kidney stone usually doesn't cause symptoms until it moves around within the kidney or passes into one of the ureters. The ureters are the tubes that connect the kidneys and bladder. If a kidney stone gets stuck in one of the ureters, it may block the flow of urine and cause the kidney to swell and the ureter to spasm. That can be very painful. At that point, you may have these symptoms: Other symptoms may include: Pain caused by a kidney stone may change as the stone moves through your urinary tract. For instance, the pain may shift to a different part of the body or become more intense. Make an appointment with your healthcare professional if you have any symptoms that worry you. Get a healthcare checkup right away if you have: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes Kidney stones often have no definite, single cause. But many factors may raise your risk. Kidney stones develop when the urine contains more crystal-forming substances than the fluid in the urine can dilute. These substances include calcium oxalate, calcium phosphate and uric acid. At the same time, the urine may lack substances that prevent crystals from sticking together. That creates an ideal setting for kidney stones to form. Knowing the type of kidney stone you have helps your healthcare professional figure out its cause and the right treatment for you. This information also can give clues on how to prevent more kidney stones. If you can, try to save your kidney stone if you pass one. Then bring it to your healthcare professional, who can check on what type of kidney stone it is. Types of kidney stones include: Calcium stones.Most kidney stones are calcium stones. They're usually made of the chemical compound calcium oxalate. Oxalate is a substance made daily by the liver or absorbed from diet. Some fruits and vegetables, as well as nuts and chocolate, have high amounts of oxalate. Dietary factors, high doses of vitamin D, intestinal bypass surgery and many conditions that affect metabolism can make calcium or oxalate more concentrated in urine. Calcium stones also can be made of calcium phosphate. This type of stone is more common in metabolic conditions such as renal tubular acidosis. It also may be linked with some medicines for migraines or seizures such as topiramate (Topamax, Trokendi XR, others). Factors that raise your risk of kidney stones include: Prevention of kidney stones may include a mix of lifestyle changes and medicines. You may lower your risk of kidney stones if you: Drink water throughout the day.This is the most important lifestyle change you can make. If you've had kidney stones before, your healthcare professional may tell you to drink enough fluids to pass about 2.1 quarts (2 liters) of urine a day or more. You may be asked to measure how much urine you pass to make sure that you're drinking enough water. If you live in a hot, dry climate or you exercise often, you may need to drink even more water to produce enough urine. If your urine is light and clear, you're likely drinking enough water. Keep eating calcium-rich foods, but use caution with calcium supplements.Calcium in food doesn't have an effect on your risk of kidney stones. Keep eating calcium-rich foods unless your healthcare professional recommends otherwise. Ask your healthcare professional before taking calcium supplements. These have been linked with a higher risk of kidney stones. You may lower the risk by taking supplements with meals. Diets low in calcium can make kidney stones more likely to form in some people. Ask your healthcare professional to refer you to a dietitian. The dietitian can help you make an eating plan that lowers your risk of kidney stones. Medicines can control the amount of minerals and salts in the urine. They may be helpful in people who form certain kinds of stones. The type of medicine that your healthcare professional prescribes depends on the kind of kidney stones you have. Here are some examples:  Kidney stones care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/menstrual-cramps/symptoms-causes/syc-20374938",
    "title": "Menstrual cramps",
    "content": "Menstrual cramps (dysmenorrhea) are throbbing or cramping pains in the lower abdomen. Many women have menstrual cramps just before and during their menstrual periods. For some women, the discomfort is merely annoying. For others, menstrual cramps can be severe enough to interfere with everyday activities for a few days every month. Conditions such as endometriosis or uterine fibroids can cause menstrual cramps. Treating the cause is key to reducing the pain. Menstrual cramps that aren't caused by another condition tend to lessen with age and often improve after giving birth. Symptoms of menstrual cramps include: Some women also have: See your health care provider if: We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. During your menstrual period, your uterus contracts to help expel its lining. Hormonelike substances (prostaglandins) involved in pain and inflammation trigger the uterine muscle contractions. Higher levels of prostaglandins are associated with more-severe menstrual cramps. Menstrual cramps can be caused by: You might be at risk of menstrual cramps if: Menstrual cramps don't cause other medical complications, but they can interfere with school, work and social activities. Certain conditions associated with menstrual cramps can have complications, though. For example, endometriosis can cause fertility problems. Pelvic inflammatory disease can scar your fallopian tubes, increasing the risk of a fertilized egg implanting outside of your uterus (ectopic pregnancy). Apr 30, 2022 CON-20374921 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/mittelschmerz/symptoms-causes/syc-20375122",
    "title": "Mittelschmerz",
    "content": "The ovaries, fallopian tubes, uterus, cervix and vagina, also called the vaginal canal, make up the female reproductive system. The ovaries, fallopian tubes, uterus, cervix and vagina, also called the vaginal canal, make up the female reproductive system. Mittelschmerz is one-sided, lower abdominal pain associated with ovulation. German for \"middle pain,\" mittelschmerz occurs midway through a menstrual cycle — about 14 days before your next menstrual period. In most cases, mittelschmerz doesn't require medical attention. For minor mittelschmerz discomfort, over-the-counter pain relievers and home remedies are often effective. If your mittelschmerz pain is troublesome, your doctor may prescribe an oral contraceptive to stop ovulation and prevent midcycle pain. Mittelschmerz pain usually lasts a few minutes to a few hours, but it may continue for as long as a day or two. Pain from mittelschmerz may be: Mittelschmerz pain occurs on the side of the ovary that's releasing an egg (ovulating). The pain may switch sides every other month, or you may feel pain on the same side for several months. Keep track of your menstrual cycle for several months and note when you feel lower abdominal pain. If it occurs midcycle and goes away without treatment, it's most likely mittelschmerz. Mittelschmerz rarely requires medical intervention. However, contact your doctor if a new pelvic pain becomes severe, if it's accompanied by nausea or fever, or if it persists — any of which could indicate you have a condition more serious than mittelschmerz, such as appendicitis, pelvic inflammatory disease or even an ectopic pregnancy. There is a problem with\r\n                                information submitted for this request. Review/update the\r\n                                information highlighted below and resubmit the form. Get the latest information from our Mayo Clinic experts on women’s health topics, serious and complex conditions, wellness and more.Click to view a previewand subscribe below. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes Mittelschmerz occurs during ovulation, when the follicle ruptures and releases its egg. Some women have mittelschmerz every month; others have it only occasionally. The exact cause of mittelschmerz is unknown, but possible reasons for the pain include these: Pain at any other point in your menstrual cycle isn't mittelschmerz. It may be normal menstrual cramping (dysmenorrhea) if it occurs during your period, or it may be from other abdominal or pelvic problems. If you have severe pain, see your doctor. Mittelschmerz has no clear risk factors. But it may be more likely to happen between the ages of 15 and 25. Mittelschmerz doesn't lead to other health conditions, also called complications. The pain goes away on its own, or with medicine or home remedies. Mittelschmerz can't be prevented. It's linked with natural changes in the body that happen during the menstrual cycle. Ovulation is the release of an egg from one of the ovaries. It often happens about midway through the menstrual cycle, although the exact timing may vary. In preparation for ovulation, the lining of the uterus, or endometrium, thickens. The pituitary gland in the brain stimulates one of the ovaries to release an egg. The wall of the ovarian follicle ruptures at the surface of the ovary. The egg is released. Finger-like structures called fimbriae sweep the egg into the neighboring fallopian tube. The egg travels through the fallopian tube, propelled in part by contractions in the fallopian tube walls. Here in the fallopian tube, the egg may be fertilized by a sperm. If the egg is fertilized, the egg and sperm unite to form a one-celled entity called a zygote. As the zygote travels down the fallopian tube toward the uterus, it begins dividing rapidly to form a cluster of cells called a blastocyst, which resembles a tiny raspberry. When the blastocyst reaches the uterus, it implants in the lining of the uterus and pregnancy begins. If the egg isn't fertilized, it's simply reabsorbed by the body — perhaps before it even reaches the uterus. About two weeks later, the lining of the uterus sheds through the vagina. This is known as menstruation.  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/shingles/symptoms-causes/syc-20353054",
    "title": "Shingles",
    "content": "Shingles is a viral infection that causes a painful rash. Shingles can occur anywhere on your body. It typically looks like a single stripe of blisters that wraps around the left side or the right side of your torso. Shingles is caused by the varicella-zoster virus — the same virus that causes chickenpox. After you've had chickenpox, the virus stays in your body for the rest of your life. Years later, the virus may reactivate as shingles. Shingles isn't life-threatening. But it can be very painful. Vaccines can help lower the risk of shingles. Early treatment may shorten a shingles infection and lessen the chance of complications. The most common complication is postherpetic neuralgia. This is a painful condition that causes shingles pain for a long time after your blisters have cleared. Shingles symptoms usually affect only a small section on one side of your body. These symptoms may include: Some people also experience: Pain is usually the first symptom of shingles. For some people, the pain can be intense. Depending on the location of the pain, it can sometimes be mistaken for problems with the heart, lungs or kidneys. Some people experience shingles pain without ever developing the rash. Most commonly, the shingles rash develops as a stripe of blisters that wraps around either the left or right side of the torso. Sometimes the shingles rash occurs around one eye or on one side of the neck or face. Shingles is characterized by pain or a tingling sensation in a limited area on one side of the face or torso, followed by a red rash with small, fluid-filled blisters. Contact your health care provider as soon as possible if you suspect shingles, especially in the following situations: We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. Shingles is caused by the varicella-zoster virus — the same virus that causes chickenpox. Anyone who's had chickenpox may develop shingles. After you recover from chickenpox, the virus enters your nervous system and stays inactive for years. Sometimes the virus reactivates and travels along nerve pathways to your skin — producing shingles. But not everyone who's had chickenpox will develop shingles. The reason for shingles is unclear. It may be due to lowered immunity to infections as people get older. Shingles is more common in older adults and in people who have weakened immune systems. Varicella-zoster is part of a group of viruses called herpes viruses. This is the same group that includes the viruses that cause cold sores and genital herpes. As a result, shingles is also known as herpes zoster. But the virus that causes chickenpox and shingles isn't the same virus that causes cold sores or genital herpes, which is a sexually transmitted infection. The shingles rash is associated with an inflammation of nerves beneath the skin. A person with shingles can pass the varicella-zoster virus to anyone who isn't immune to chickenpox. This usually occurs through direct contact with the open sores of the shingles rash. Once infected, though, the person will develop chickenpox rather than shingles. Chickenpox can be dangerous for some people. Until your shingles blisters scab over, you are contagious. Avoid physical contact with anyone who hasn't yet had chickenpox or the chickenpox vaccine. That includes people with weakened immune systems, pregnant women and newborns. Anyone who has ever had chickenpox can develop shingles. Most adults in the United States had chickenpox when they were children. That was before the availability of the routine childhood vaccination that now protects against chickenpox. Factors that may increase your risk of developing shingles include: Complications from shingles can include: A shingles vaccine may help prevent shingles. People who are eligible should get the Shingrix vaccine, which has been available in the United States since its approval by the Food and Drug Administration in 2017. The Zostavax vaccine is no longer available in the U.S., but other countries may still use it. Shingrix is approved and recommended for people age 50 and older, whether they've had shingles or not. People who've had the Zostavax vaccine in the past or don't know whether they've had chickenpox may also receive the Shingrix vaccine. Shingrix is also recommended for people who are 19 years of age and older who have weakened immune systems due to disease or medication. Shingrix is a nonliving vaccine made of a virus component. It's given in two doses, with 2 to 6 months between doses. The most common side effects of the shingles vaccine are redness, pain and swelling at the injection site. Some people also experience fatigue, headache and other side effects. The shingles vaccine doesn't guarantee that you won't get shingles. But this vaccine will likely reduce the course and severity of the disease. And it will likely lower your risk of postherpetic neuralgia. Studies suggest that Shingrix offers protection against shingles for more than five years. Talk to your health care provider about your vaccination options if you: The shingles vaccine is used only as a way to prevent shingles. It's not intended to treat people who currently have the disease.  Vaccine planner Aug 20, 2022 CON-20309658 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/diarrhea/symptoms-causes/syc-20352241",
    "title": "Diarrhea",
    "content": "The small intestine and colon are parts of the digestive tract, which processes the foods you eat. The intestines take nutrients from the foods. What isn't absorbed by the intestines moves along the digestive tract and is passed out of the body as stool. The small intestine and colon are parts of the digestive tract, which processes the foods you eat. The intestines take nutrients from the foods. What isn't absorbed by the intestines moves along the digestive tract and is passed out of the body as stool. Diarrhea — loose, watery and possibly more-frequent passage of stool — is a common problem. Sometimes, it's the only symptom of a condition. At other times, it may be associated with other symptoms, such as nausea, vomiting, abdominal pain or weight loss. Luckily, diarrhea is usually short-lived, lasting no more than a few days. But when diarrhea lasts beyond a few days, it is usually a clue to another problem — such as medicine side effects, changes in diet, irritable bowel syndrome (IBS), or a more serious disorder, including ongoing infection, celiac disease or inflammatory bowel disease (IBD). Symptoms associated with loose, watery stools, also called diarrhea, may include: If you're an adult, see your doctor if: In children, particularly young children, diarrhea can quickly lead to dehydration. Call your doctor if your child's diarrhea doesn't improve within 24 hours or if your child: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes A number of diseases and conditions can cause diarrhea, including: Some common risk factors for diarrhea include: Diarrhea can cause dehydration, which can be life-threatening if not treated. Dehydration is particularly dangerous in children, older adults and those with weakened immune systems. If you have symptoms of serious dehydration, seek medical help. These include: These include: Wash your hands to prevent the spread of infectious diarrhea. To ensure adequate hand-washing: You can help protect your infant from rotavirus, the most common cause of viral diarrhea in children, with one of two approved vaccines. Ask your baby's doctor about having your baby vaccinated. Diarrhea commonly affects people who travel to countries with poor sanitation and contaminated food. To reduce your risk: Watch what you drink.Drink bottled water, soda, beer or wine served in its original container. Don't drink tap water or use ice cubes. Use bottled water even for brushing your teeth. Keep your mouth closed while you shower. Beverages made with boiled water, such as coffee and tea, are probably safe. Remember that alcohol and caffeine can aggravate diarrhea and worsen dehydration.  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/endometriosis/symptoms-causes/syc-20354656",
    "title": "Endometriosis",
    "content": "Learn more about endometriosis from Megan Wasson, D.O., a minimally invasive gynecologic surgeon at Mayo Clinic. Hi, I'm Dr. Megan Wasson, a minimally invasive gynecologic surgeon at Mayo Clinic. In this video, we will cover the basics of endometriosis, including what is it, who gets it, as well as the symptoms, diagnosis and treatment. Whether you are looking for answers for yourself or someone you love, we are here to give you the best information available. Endometriosis is a condition in which cells similar to the lining of the uterus, or endometrium, grow outside the uterus. Endometriosis often involves the pelvic tissue and can envelop the ovaries and fallopian tubes. It can affect nearby organs, including the bowel and bladder. So during the menstrual cycle, or period, this tissue responds to hormones, and due to its location, frequently results in pain. Endometriosis causes surrounding tissues to become irritated and potentially develop scars and sticky fibers that bind tissues together. In some cases, endometriosis can cause cysts on the ovaries. These are called endometriomas. Fortunately, there are effective treatments to manage and treat endometriosis. There are some possible explanations of what sparks the endometrial-like tissue to grow out of place. But the exact cause is still uncertain. However, there are some factors that make someone more likely to get endometriosis, such as never giving birth, menstrual cycles occurring more frequently than every 28 days, heavy and prolonged menstrual periods that lasts longer than seven days, having higher levels of estrogen in your body, having a low body mass index, having a structural issue with the vagina, cervix, or uterus that prevents the passage of menstrual blood from the body, a family history of endometriosis, starting your period at an early age, or starting menopause at an older age. The most common symptom of endometriosis is pelvic pain, either during or outside of the normal menstrual period that is beyond normal cramping, Normal menstrual cramping should be tolerable and should not require someone to miss time from school, work or normal activities. Other symptoms include cramps that begin before and extend after a menstrual period, lower back or abdominal pain, pain with intercourse, pain with bowel movements or urination, and infertility. Individuals with endometriosis may experience fatigue, constipation, bloating, or nausea, especially during periods. If you are feeling these symptoms, it's a good idea to talk to your health care provider. First, your provider will ask you to describe your symptoms, including the location of the pelvic pain. Next, they may do a pelvic exam, an ultrasound, or an MRI to get a clearer view of the reproductive organs, including the uterus, ovaries, and fallopian tubes. To definitively diagnose endometriosis, surgery is required. This is most commonly performed by laparoscopy. The patient is under general anesthesia while the surgeon inserts a camera into the abdomen through a small incision to evaluate for endometrial-like tissue. Any tissue that looks like endometriosis is removed and examined under the microscope to confirm the presence or absence of endometriosis. When it comes to treating endometriosis, first steps involve trying to manage symptoms through pain medications or hormone therapy. Hormones, such as birth control pills, control the rise and fall of estrogen and progesterone in the menstrual cycle. If those initial treatments fail and symptoms are impacting a person's quality of life, surgery to remove endometriosis tissue may be considered. Dealing with endometriosis, its pain, complications and fertility problems can be hard to cope with and be stressful. Consider joining a support group of people who can relate to what you are going through. If you'd like to learn even more about endometriosis, watch our other related videos or visit mayoclinic.org. We wish you well. With endometriosis, bits of the uterine lining (endometrium) — or similar endometrial-like tissue — grow outside of the uterus on other pelvic organs. Outside the uterus, the tissue thickens and bleeds, just as typical endometrial tissue does during menstrual cycles. With endometriosis, bits of the uterine lining (endometrium) — or similar endometrial-like tissue — grow outside of the uterus on other pelvic organs. Outside the uterus, the tissue thickens and bleeds, just as typical endometrial tissue does during menstrual cycles. Endometriosis (en-doe-me-tree-O-sis) is an often-painful condition in which tissue that is similar to the inner lining of the uterus grows outside the uterus. It often affects the ovaries, fallopian tubes and the tissue lining the pelvis. Rarely, endometriosis growths may be found beyond the area where pelvic organs are located. Endometriosis tissue acts as the lining inside the uterus would — it thickens, breaks down and bleeds with each menstrual cycle. But it grows in places where it doesn't belong, and it doesn't leave the body. When endometriosis involves the ovaries, cysts called endometriomas may form. Surrounding tissue can become irritated and form scar tissue. Bands of fibrous tissue called adhesions also may form. These can cause pelvic tissues and organs to stick to each other. Endometriosis can cause pain, especially during menstrual periods. Fertility problems also may develop. But treatments can help you take charge of the condition and its complications. The main symptom of endometriosis is pelvic pain. It's often linked with menstrual periods. Although many people have cramping during their periods, those with endometriosis often describe menstrual pain that's far worse than usual. The pain also may become worse over time. Common symptoms of endometriosis include: The seriousness of your pain may not be a sign of the number or extent of endometriosis growths in your body. You could have a small amount of tissue with bad pain. Or you could have lots of endometriosis tissue with little or no pain. Still, some people with endometriosis have no symptoms. Often, they find out they have the condition when they can't get pregnant or after they get surgery for another reason. For those with symptoms, endometriosis sometimes may seem like other conditions that can cause pelvic pain. These include pelvic inflammatory disease or ovarian cysts. Or it may be confused with irritable bowel syndrome (IBS), which causes bouts of diarrhea, constipation and stomach cramps. IBS also can happen along with endometriosis. This makes it harder for your health care team to find the exact cause of your symptoms. See a member of your health care team if you think you might have symptoms of endometriosis. Endometriosis can be a challenge to manage. You may be better able to take charge of the symptoms if: There is a problem with\r\n                                information submitted for this request. Review/update the\r\n                                information highlighted below and resubmit the form. Get the latest information from our Mayo Clinic experts on women’s health topics, serious and complex conditions, wellness and more.Click to view a previewand subscribe below. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes The exact cause of endometriosis isn't clear. But some possible causes include: Factors that raise the risk of endometriosis include: Any health condition that prevents blood from flowing out of the body during menstrual periods also can be an endometriosis risk factor. So can conditions of the reproductive tract. Endometriosis symptoms often happen years after menstruation starts. The symptoms may get better for a time with pregnancy. Pain may become milder over time with menopause, unless you take estrogen therapy. During fertilization, the sperm and egg unite in one of the fallopian tubes to form a zygote. Then the zygote travels down the fallopian tube, where it becomes a morula. Once it reaches the uterus, the morula becomes a blastocyst. The blastocyst then burrows into the uterine wall — a process called implantation. During fertilization, the sperm and egg unite in one of the fallopian tubes to form a zygote. Then the zygote travels down the fallopian tube, where it becomes a morula. Once it reaches the uterus, the morula becomes a blastocyst. The blastocyst then burrows into the uterine wall — a process called implantation. The main complication of endometriosis is trouble getting pregnant, also called infertility. Up to half of people with endometriosis have a hard time conceiving. For pregnancy to happen, an egg must be released from an ovary. Then the egg has to travel through the fallopian tube and become fertilized by a sperm cell. The fertilized egg then needs to attach itself to the wall of the uterus to start developing. Endometriosis may block the tube and keep the egg and sperm from uniting. But the condition also seems to affect fertility in less-direct ways. For instance, it may damage the sperm or egg. Even so, many with mild to moderate endometriosis can still conceive and carry a pregnancy to term. Health care professionals sometimes advise those with endometriosis not to delay having children. That's because the condition may become worse with time. Some studies suggest that endometriosis raises the risk of ovarian cancer. But the overall lifetime risk of ovarian cancer is low to begin with. And it stays fairly low in people with endometriosis. Although rare, another type of cancer called endometriosis-associated adenocarcinoma can happen later in life in those who've had endometriosis.  Endometriosis care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/abdominal-aortic-aneurysm/symptoms-causes/syc-20350688",
    "title": "Abdominal aortic aneurysm",
    "content": "An abdominal aortic aneurysm occurs when a lower part of the body's main artery, called the aorta, gets weak and bulges outward like a balloon. An abdominal aortic aneurysm occurs when a lower part of the body's main artery, called the aorta, gets weak and bulges outward like a balloon. An abdominal aortic aneurysm is an enlarged area in the lower part of the body's main artery, called the aorta. The aorta goes from the heart through the center of the chest and belly area, called the abdomen. An abdominal aortic aneurysm that ruptures can cause life-threatening bleeding. Treatment depends on how big the aneurysm is and how fast it's growing. Treatment may include regular health checkups and imaging tests to emergency surgery. Abdominal aortic aneurysms often grow slowly. You might not notice any symptoms. This makes them hard to find. Many start small and stay small. Others get bigger over time, sometimes quickly. Some aneurysms never rupture. If you have an abdominal aortic aneurysm that's getting bigger, symptoms might include: If you have pain, especially if pain is sudden and very bad, get medical help right away. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes An aneurysm can grow in any part of the aorta. Most aortic aneurysms happen in the part of the aorta that's in the belly area, called the abdomen. Things that can cause an abdominal aortic aneurysm include: Abdominal aortic aneurysm risk factors include: If you're at risk of an aortic aneurysm, medicines may be given to lower blood pressure and relieve stress on weakened arteries. Possible complications of abdominal aortic aneurysms include: A rupture can cause life-threatening bleeding inside the body. In general, the larger the aneurysm and the faster it grows, the greater the risk of rupture. Symptoms that an aortic aneurysm has ruptured can include: Aortic aneurysms also increase the risk of developing blood clots in the area. If a blood clot breaks loose, it can block a blood vessel elsewhere in the body. Symptoms of a blocked blood vessel may include pain or reduced blood flow to the legs, toes, kidneys or belly area. To prevent an abdominal aortic aneurysm or to keep one from worsening, take these steps:  Abdominal aortic aneurysm care at Mayo Clinic Connect with others like you for support and answers to your questions in theAortic Aneurysms support groupon Mayo Clinic Connect, a patient community. 276 RepliesSat, Aug 02, 2025 52 RepliesFri, Aug 01, 2025 517 RepliesSat, Jul 26, 2025 Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/appendicitis/symptoms-causes/syc-20369543",
    "title": "Appendicitis",
    "content": "The appendix is a narrow, finger-shaped pouch that sticks out from the colon. Appendicitis occurs when the appendix becomes inflamed and filled with pus. The appendix is a narrow, finger-shaped pouch that sticks out from the colon. Appendicitis occurs when the appendix becomes inflamed and filled with pus. Appendicitis is an inflammation of the appendix. The appendix is a finger-shaped pouch that sticks out from the colon on the lower right side of the belly, also called the abdomen. Appendicitis causes pain in the lower right part of the belly. However, in most people, pain begins around the belly button and then moves. As inflammation worsens, appendicitis pain typically increases and eventually becomes serious. Although anyone can develop appendicitis, most often it happens in people between the ages of 10 and 30. Treatment of appendicitis is usually antibiotics and, in most instances, surgery to remove the appendix. Symptoms of appendicitis may include: The site of the pain may vary, depending on age and the position of the appendix. In pregnancy, the pain may seem to come from the upper belly because the appendix is higher during pregnancy. Make an appointment with a healthcare professional if you or your child has symptoms. Terrible belly pain requires immediate medical attention. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Sign up for free and stay up to date on research advancements, health tips, current health topics, and expertise on managing health.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email. You'll soon start receiving the latest Mayo Clinic health information you requested in your inbox. Please, try again in a couple of minutes A blockage in the lining of the appendix, called the lumen, is the likely cause of appendicitis. This blockage can cause an infection. The bacteria then multiply quickly, causing the appendix to become inflamed, swollen and filled with pus. If not treated right away, the appendix may burst or break open. Risk factors for appendicitis include: Appendicitis may cause serious complications, such as: A pocket of pus that forms in the abdomen.If the appendix bursts, a pocket of infection may develop. This is called an abscess. In most cases, a surgeon drains the abscess by placing a tube through the abdominal wall into the abscess. The tube is left in place for about two weeks, and antibiotics are prescribed to clear the infection. Once the infection is clear, the appendix can be removed surgically. In some people, the abscess is drained, and the appendix is removed immediately.  Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/peptic-ulcer/symptoms-causes/syc-20354223",
    "title": "Peptic ulcer",
    "content": "Peptic ulcers are open sores on the inner lining of the stomach and the upper part of the small intestine. A peptic ulcer in the stomach is called a gastric ulcer. A duodenal ulcer is a peptic ulcer that appears in the first part of the small intestine, called the duodenum. Peptic ulcers are open sores on the inner lining of the stomach and the upper part of the small intestine. A peptic ulcer in the stomach is called a gastric ulcer. A duodenal ulcer is a peptic ulcer that appears in the first part of the small intestine, called the duodenum. Peptic ulcers are open sores on the inner lining of the stomach and the upper part of the small intestine. The most common symptom of a peptic ulcer is stomach pain. Peptic ulcers include: The most common causes of peptic ulcers are infection with the germ Helicobacter pylori (H. pylori) and long-term use of nonsteroidal anti-inflammatory drugs (NSAIDs). These include ibuprofen (Advil, Motrin IB, others) and naproxen sodium (Aleve). Stress and spicy foods do not cause peptic ulcers. But they can make symptoms worse. Many people with peptic ulcers don't have symptoms. If there are symptoms, they may include: Peptic ulcers can cause bleeding from the ulcer. Then symptoms might include: See your healthcare professional if you're vomiting blood, having dark blood in stools or are feeling dizzy. Also see your healthcare professional if nonprescription antacids and acid blockers relieve your pain but the pain returns. There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes Peptic ulcers happen when acid in the organs that food travels through, called the digestive tract, eats away at the inner surface of the stomach or small intestine. The acid can create a painful open sore that may bleed. Your digestive tract is coated with a mucous layer that most often protects against acid. But if the amount of acid increases or the amount of mucus decreases, you could develop an ulcer. Common causes include: Helicobacter pylori.This germ lives in the mucous layer that covers and protects tissues that line the stomach and small intestine. The H. pylori germ often causes no problems. But it can cause swelling and irritation, called inflammation, of the stomach's inner layer. When this happens, it can cause an ulcer. It's not clear how H. pylori infection spreads. It may go from person to person by close contact, such as kissing. People also can contract H. pylori through food and water. If you take NSAIDs, the following factors may increase your risk of peptic ulcers: NSAIDs use.Taking high doses of NSAIDs or two or more NSAIDs increases the risk. So does taking NSAIDS with certain other medicines. These include other pain relievers, steroids, blood thinners, certain antidepressants called selective serotonin reuptake inhibitors (SSRIs) and medicines to treat the bone-thinning disease osteoporosis. These include alendronate (Fosamax, Binosto) and risedronate (Actonel, Atelvia). Factors that don't cause peptic ulcers but can make them worse include: Untreated peptic ulcers can cause: To help prevent peptic ulcers: Take care with pain relievers.If you often use NSAIDs, which can increase your risk of peptic ulcer, take steps to reduce your risk of stomach problems. For instance, take pain relievers with meals. Work with your healthcare professional to find the lowest dose that gives you pain relief. Don't drink alcohol with pain relievers. Together, they can increase your risk of stomach upset. If you need an NSAID, you also may need to take other medicines to help protect your stomach. These include antacids, proton pump inhibitors, acid blockers or cytoprotective agents. A class of NSAIDs called COX-2 inhibitors may be less likely to cause peptic ulcers. But these medicines may increase the risk of heart attack.  Peptic ulcer care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  },
  {
    "url": "https://www.mayoclinic.org/diseases-conditions/crohns-disease/symptoms-causes/syc-20353304",
    "title": "Crohn's disease",
    "content": "Learn more about Crohn's disease from gastroenterologist William Faubion, M.D. {Music playing} William A. Faubion, Jr., M.D., Gastroenterology, Mayo Clinic:I'm Dr. Bill Faubion, a gastroenterologist at Mayo Clinic. In this video, we'll cover the basics of Crohn's disease. What it is? Who gets it? The symptoms, diagnosis and treatment. Whether you're looking for answers for yourself or someone you love, we're here to give you the best information available. Crohn's disease is an inflammatory bowel disease that causes chronic inflammation of theGItract, which extends from your stomach all the way down to your anus. Different areas of theGItract can be affected in different people, and it often spreads into the deeper layers of the bowel. It's estimated that over half a million Americans are living with Crohn's disease. It can be painful and debilitating, occasionally leading to severe complications, as well as emotionally stressful. And while there is no cure, once you've been diagnosed, treatment can help you get back to a more normal and comfortable life. Who gets it? There are a lot of particulars that figure into or aggravate Crohn's disease, but the exact cause is still unknown. It may involve an abnormal immune response against some microorganism in which your tissues are also attacked. Genetics might also play a role. And it's true that you're at higher risk if a first-degree relative has it. But that's really only seen in about 20% of cases. There is a correlation with age. Although it can show up at any stage of life, most people are diagnosed before 30. Ethnicity is a risk factor. Whites have the highest risk, especially among people of Ashkenazi Jewish descent. However, incidence is increasing among black people in North America and the UK. Non-steroidal anti-inflammatory medications or NSAIDS... they don't cause Crohn's disease, but they are known to trigger inflammation of the bowel and make it worse. They include common over-the-counter painkillers like ibuprofen, naproxen sodium, diclofenac sodium, and others. So if you've been diagnosed with Crohn's, make sure you talk to your doctor about what medications should be avoided. Many of these elements are out of our hands, but smoking is the most important controllable risk factor for developing Crohn's disease. It also leads to more severe disease and increased need for surgery. So if you smoke and you're diagnosed, now is a good time to quit. What are the symptoms? Crohn's disease can affect any area in theGItract, but it's mostly found in the large and the small intestine. It can also be confined to one area or found in multiple segments. Symptoms can range in severity and it can depend on the area of theGItract that's affected. You also may experience periods of remission when you have no symptoms or issues at all. The symptoms can come on gradually, but they can also show up suddenly. And these can include diarrhea, fever, fatigue, abdominal pain and cramping, blood in your stool, mouth sores, reduced appetite and weight loss. If your Crohn's disease has caused fistulas or inflamed tunnels in the skin near the anal area, you may notice pain or drainage. And in more severe cases, you may have inflammation of the eyes, skin, joints, liver or bile ducts, kidney stones, and anemia. In children, it can delay growth and development. Over time, Crohn's disease can lead to other complications, including bowel obstruction, ulcers, fistulas, anal fissures, malnutrition, and other health problems. It can also increase your risk for blood clots and colon cancer. Having these symptoms doesn't automatically mean you have Crohn's. But if you're experiencing anything that concerns you, it's a good idea to make an appointment with your doctor. How is it diagnosed? There's no single test for Crohn's disease, and it has similar symptoms to a lot of other conditions, so it can take a little time to get a diagnosis. First, your doctor is going to consider your medical history. Then your doctor may want to run a variety of tests or procedures. And at some point, your general practitioner may want to refer you to a specialist called a gastroenterologist like myself. A blood test can check for anemia and check for signs of infection. A stool study can test if there's blood present or rule out certain pathogens. A colonoscopy may be needed. This also allows your doctor to view your entire colon and the very end of the ileum using an endoscope, a small camera mounted on a thin flexible tube. They can take tissue samples for a biopsy at the same time. And the presence of granulomas or clusters of inflammatory cells, can essentially confirm the diagnosis. ACTscan might be ordered for a better look at the bowel and all of the surrounding tissues; or anMRI, which is especially good for evaluating fistulas around the anus or the small intestine. A capsule endoscopy can be done. Here you actually swallow the camera about the size of a large vitamin and it takes images of your digestive tract as it travels through. And a balloon-assisted enteroscopy may be done to get further into the bowel than a standard endoscope can if abnormalities have been found that need further investigation. How is it treated? Your doctor can work with you to find therapies that alleviate your symptoms. One of the main goals is to reduce the inflammation that produces painful and disruptive issues. Another is to limit complications over the long-term. There is currently no cure, but many treatments can provide a lot of relief, and in some cases, even long-term remission. These may include anti-inflammatory drugs like corticosteroids, immune system suppressants, and antibiotics. Certain biologics, which target proteins made by the immune system, can help. Antidiarrheals, pain relievers, and supplements can help counter other symptoms. Nutritional therapy and a special diet may be recommended. And in some cases where other measures aren't effective, surgery may be required. And that's to remove the damaged tissue. Some of these therapies may have side effects themselves. So be sure and review the risks and benefits with your doctor. What now? Crohn's disease can be physically and emotionally challenging, but there are things that can help. Although there's no firm evidence that any particular foods cause Crohn's disease, certain things seem to aggravate flare-ups. So a food diary can help you identify personal triggers. Beyond that, limit dairy products, eating smaller meals, stay hydrated, and try to avoid caffeine, alcohol, and carbonation. Consider multivitamins if you're concerned about weight loss. Or if your diet has become too limited, talk to a registered dietitian. And again, if you smoke, you should stop. It's important to take care of your mental health too. Find ways to manage stress, like exercise, breathing, relaxation techniques or biofeedback. Some symptoms like abdominal pain, gas, and diarrhea... they can cause anxiety and frustration. They can make it difficult to go out in public for any amount of time. It can feel limiting and isolating and lead to depression. So learn as much as you can about Crohn's. Staying informed can help a lot in feeling like you're in control of your condition. Talk to a therapist, especially one familiar with inflammatory bowel disease. Your doctor can give you some recommendations. And you might want to find a support group of people going through the same thing that you are. Crohn's disease is a complex disease. But having expert medical care and developing a treatment strategy can make it more manageable and even help you get back to the freedom of your normal life. Meanwhile, significant advances continue to be made in understanding and treating the disease, getting us closer to curing it or preventing it entirely. If you'd like to learn more about Crohn's disease, here are other related videos or visit mayoclinic.org. We wish you well. The colon, also called the large intestine, is a long tubelike organ in the abdomen. The colon carries waste to be expelled from the body. The rectum makes up the last several inches of the large intestine. The colon, also called the large intestine, is a long tubelike organ in the abdomen. The colon carries waste to be expelled from the body. The rectum makes up the last several inches of the large intestine. Crohn's disease is a type of inflammatory bowel disease (IBD) that causes swelling and irritation of the tissues, called inflammation, in the digestive tract. This can lead to belly pain, severe diarrhea, fatigue, weight loss and malnutrition. Inflammation caused by Crohn's disease can affect different areas of the digestive tract in different people. Crohn's most commonly affects the end of the small intestine and the beginning of the large intestine. The inflammation often spreads into the deeper layers of the bowel. Crohn's disease can be both painful and debilitating. Sometimes, it may lead to serious or life-threatening complications. There's no known cure for Crohn's disease, but therapies can greatly reduce its symptoms and even bring about long-term remission and healing of inflammation. With treatment, many people with Crohn's disease can function well. The sections of the small intestine are the duodenum, jejunum and ileum. The sections of the small intestine are the duodenum, jejunum and ileum. Symptoms of Crohn's disease typically include: Crohn's disease can affect any part of the small or large intestine. It may involve multiple segments, or it may be continuous. It most commonly involves the last part of the small intestine. In some people, the disease is only in the colon or the large intestine. Symptoms of Crohn's disease can range from mild to severe. They usually develop gradually, but sometimes might come on suddenly, without warning. Someone with Crohn's disease also may have periods of time with no symptoms. This is known as remission. People with severe Crohn's disease also may experience symptoms outside of the intestinal tract, including: See a healthcare professional if you have ongoing changes in your bowel habits or if you have any symptoms of Crohn's disease, such as: There is a problem with\n                                information submitted for this request. Review/update the\n                                information highlighted below and resubmit the form. Subscribe for free and receive your in-depth guide to\n                            digestive health, plus the latest on health innovations and news. You can unsubscribe at any\n                            time.Click here for an email preview. ErrorEmail field is required ErrorInclude a valid email address We use the data you provide to deliver you the content you requested. To provide you with the most relevant and helpful information, we may combine your email and website data with other information we have about you. If you are a Mayo Clinic patient, we will only use your protected health information as outlined in ourNotice of Privacy Practices. You may opt out of email communications at any time by clicking on the unsubscribe link in the email.  Your in-depth digestive health guide will be in your inbox shortly. You will also receive\n                                emails from Mayo Clinic on the latest health news, research, and care. If you don’t receive our email within 5 minutes, check your SPAM folder, then contact us\n                                atnewsletters@mayoclinic.com. Please, try again in a couple of minutes The exact cause of Crohn's disease remains unknown. Previously, diet and stress were suspected, but now healthcare professionals know that these factors may aggravate, but don't cause, Crohn's disease. Several factors likely play a role in its development. Risk factors for Crohn's disease may include: Crohn's disease may lead to one or more of the following complications: Fistulas.Sometimes ulcers can extend completely through the intestinal wall, creating a connection between different body parts that shouldn't be there. This is known as a fistula. Fistulas can develop between the intestine and the skin, or between the intestine and another organ. Fistulas near or around the anal area are the most common kind. When fistulas develop inside the abdomen, it may lead to infections and collections of pus called abscesses. This can be life-threatening if not treated. Fistulas may form between loops of bowel, in the bladder or vagina, or through the skin, causing continuous drainage of bowel contents to the skin. Colon cancer.Having Crohn's disease that affects the colon increases the risk of colon cancer. General colon cancer screening guidelines for people without Crohn's disease call for a colonoscopy at least every 10 years beginning at age 45. In people with Crohn's disease affecting a large part of the colon, a colonoscopy to screen for colon cancer is recommended about eight years after disease onset and generally is performed every 1 to 2 years afterward. Ask a healthcare professional whether you need to have this test done sooner and more frequently. Medicine risks.Certain Crohn's disease medicines that block functions of the immune system are associated with a small risk of developing cancers, including lymphoma and skin cancers. They also increase the risk of infections. Corticosteroids can be associated with a risk of osteoporosis, bone fractures, cataracts, glaucoma, diabetes and high blood pressure, among other conditions. Work with a healthcare professional to determine risks and benefits of medicines.  Crohn's disease care at Mayo Clinic Mayo Clinic does not endorse companies or products. Advertising revenue supports our not-for-profit mission. Check out these best-sellers and special offers on books and newsletters fromMayo Clinic Press. Your donation powers the future of medicine and helps save lives. © 1998-2025 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved."
  }
]